BellerageHackathon/src/Catalogs/ВопросыВерсийТестов/ВопросыВерсийТестов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВопросыВерсийТестов</name>
  <owners>Catalog.ВерсииТестов</owners>
  <attributes>
    <name>ИдентификаторВопроса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторВерсииВопроса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокВВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстВопроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОтвета</name>
    <type>
      <types>EnumRef.ТипыОтветов</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйБалл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПроверки</name>
    <type>
      <types>EnumRef.СпособыПроверкиОтвета</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭталонныйОтвет</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьРегистр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбрезатьПробелыПоКраям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СхлопыватьПовторныеПробелы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

BellerageHackathon/src/Enums/ТипыОтветов/ТипыОтветов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОтветов</name>
  <enumValues>
    <name>ОдинПравильныйОтвет</name>
  </enumValues>
  <enumValues>
    <name>НесколькоПравильныхОтветов</name>
  </enumValues>
  <enumValues>
    <name>ПолеВвода</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Enums/СпособыПроверкиОтвета/СпособыПроверкиОтвета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПроверкиОтвета</name>
  <enumValues>
    <name>ТочныйВариант</name>
  </enumValues>
  <enumValues>
    <name>ТочныйНабор</name>
  </enumValues>
  <enumValues>
    <name>ТекстПоЭталону</name>
  </enumValues>
  <enumValues>
    <name>РучнаяПроверка</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Enums/СтатусыВерсийТестов/СтатусыВерсийТестов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыВерсийТестов</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Опубликована</name>
  </enumValues>
  <enumValues>
    <name>ЗамененаНовой</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Catalogs/ВопросыВерсийТестов/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
        Если Объект.ПорядокВВерсии = 0 Тогда Объект.ПорядокВВерсии = РабочееМестоТестированияСервер.СледующийПорядок("ВопросыВерсийТестов", Объект.Владелец); КонецЕсли;
        Если Объект.МаксимальныйБалл = 0 Тогда Объект.МаксимальныйБалл = 1; КонецЕсли;
        Если Не ЗначениеЗаполнено(Объект.ТипОтвета) Тогда Объект.ТипОтвета = Перечисления.ТипыОтветов.ОдинПравильныйОтвет; КонецЕсли;
        Если Не ЗначениеЗаполнено(Объект.СпособПроверки) Тогда Объект.СпособПроверки = Перечисления.СпособыПроверкиОтвета.ТочныйВариант; КонецЕсли;
    КонецЕсли;
    ОбновитьДанные();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    ОбновитьДанные();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанные()
    Элементы.Данные.ТолькоПросмотр = ЗначениеЗаполнено(Объект.Владелец) И Объект.Владелец.СтатусВерсии <> Перечисления.СтатусыВерсийТестов.Черновик;
    Таблица = РабочееМестоТестированияСервер.СписокПодчиненных("ВариантыОтветовВерсий", Объект.Ссылка);
    ЗначениеВРеквизитФормы(Таблица, "Строки");
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
    Если ЗначениеЗаполнено(Объект.Ссылка) И Не Модифицированность Тогда Прочитать(); КонецЕсли;
    ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтроку(Команда)
    Строка = Элементы.Строки.ТекущиеДанные;
    Если Строка = Неопределено Тогда Возврат; КонецЕсли;
    ОткрытьФорму("Справочник.ВариантыОтветовВерсий.Форма.ФормаЭлемента", Новый Структура("Ключ", Строка.Ссылка), ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВариант(Команда)
    Если Не Записать() Тогда Возврат; КонецЕсли;
    Заполнение = Новый Структура("Владелец", Объект.Ссылка);
    ОткрытьФорму("Справочник.ВариантыОтветовВерсий.Форма.ФормаЭлемента", Новый Структура("ЗначенияЗаполнения", Заполнение), ЭтаФорма);
КонецПроцедуры
